In [1]:
import pandas as pd
from pyproj import Proj
import numpy as np
import math
import matplotlib.pyplot as plt
from sklearn import datasets, linear_model
from sklearn import cross_validation
from sklearn.metrics import mean_squared_error
import seaborn as sns
sns.set(color_codes=True)
import collections

%matplotlib inline

In [10]:
data_path = "data/merged/manhattan_brooklyn_2014_2015.csv"
df = pd.DataFrame.from_csv(data_path, index_col = False)
df.head()

,borough,block,schooldist,council,zipcode,ltdheight,splitzone,bldgclass,landuse,easements,...,sale_price,sale_date,tax_class_at_time_of_sale,year_built,residential_units,commercial_units,total_units,bbl_pluto,unit_bbl,price_per_sqft
0,BK,20.0,13.0,33.0,11201.0,0.0,0.0,RM,4.0,1.0,...,1598000,2014-04-30,2,1920,1,0,1,3.000208e+09,3.000201e+09,57.515117
1,BK,20.0,13.0,33.0,11201.0,0.0,0.0,RM,4.0,1.0,...,1598000,2014-04-30,2,1920,1,0,1,3.000208e+09,3.000201e+09,57.515117
2,BK,20.0,13.0,33.0,11201.0,0.0,0.0,RM,4.0,1.0,...,3309312,2014-05-23,2,1920,1,0,1,3.000208e+09,3.000201e+09,119.108552
3,BK,20.0,13.0,33.0,11201.0,0.0,0.0,RM,4.0,1.0,...,3309312,2014-05-23,2,1920,1,0,1,3.000208e+09,3.000201e+09,119.108552
4,BK,20.0,13.0,33.0,11201.0,0.0,0.0,RM,4.0,1.0,...,1210000,2014-06-09,2,1920,1,0,1,3.000208e+09,3.000201e+09,43.550245

In [12]:
df.shape

(84948, 51)

In [11]:
no_dups = df.drop_duplicates()
no_dups.shape

(20089, 51)

In [13]:
data_path = "data/merged/finance_manhattan_brooklyn_2014_2015.csv"
finance = pd.DataFrame.from_csv(data_path, index_col = False)
finance.head()

,sale_price,sale_date,tax_class_at_time_of_sale,year_built,residential_units,commercial_units,total_units,block,bbl
0,0,2014-03-21,4,1920,0,90,90,1,3000010050
1,1598000,2014-04-30,2,1920,1,0,1,20,3000201001
2,3309312,2014-05-23,2,1920,1,0,1,20,3000201002
3,1210000,2014-06-09,2,1920,1,0,1,20,3000201003
4,1333907,2014-05-21,2,1920,1,0,1,20,3000201004

In [14]:
finance.shape

(138672, 9)

In [15]:
finance_no_dups = finance.drop_duplicates()
finance_no_dups.shape

(69336, 9)

In [17]:
data_path = "data/merged/pluto_manhattan_brooklyn_2014_2015.csv"
pluto = pd.DataFrame.from_csv(data_path, index_col = False)
pluto.head()

,borough,block,schooldist,council,zipcode,ltdheight,splitzone,bldgclass,landuse,easements,...,condono,xcoord,ycoord,zonemap,latitude,longitude,gross_sqft_pluto,garage,extension,countalter
0,BK,1,13.0,33.0,11201.0,0,0.0,D7,4.0,0,...,0.0,987624.0,195992.0,12d,40.704629,-73.987831,123199.0,0,0,1
1,BK,1,13.0,33.0,11201.0,0,1.0,E9,6.0,0,...,0.0,987838.0,195989.0,12d,40.704621,-73.987059,154400.0,0,0,2
2,BK,7,13.0,33.0,11201.0,0,0.0,G1,10.0,0,...,0.0,987216.0,195803.0,12d,40.704110,-73.989303,9585.0,0,0,1
3,BK,16,13.0,33.0,11201.0,0,0.0,Q0,9.0,0,...,0.0,986856.0,195975.0,12d,40.704582,-73.990601,5000.0,0,0,0
4,BK,18,13.0,33.0,11201.0,0,0.0,D5,3.0,0,...,0.0,987577.0,195811.0,12d,40.704132,-73.988001,211386.0,0,0,1

In [18]:
pluto_no_dups = pluto.drop_duplicates()
pluto_no_dups.shape

(305187, 41)

In [19]:
pluto.shape

(305187, 41)

In [35]:
finance.groupby(['sale_date'])

In [38]:
finance.sort(columns = ['bbl','sale_date'])

//anaconda/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  if __name__ == '__main__':

,sale_price,sale_date,tax_class_at_time_of_sale,year_built,residential_units,commercial_units,total_units,block,bbl
42290,0,2014-03-01,4,1900,0,0,0,1,1000010010
55548,0,2014-03-01,4,1900,0,0,0,1,1000010010
42291,30150000,2014-10-27,4,0,0,0,1,7,1000071001
55549,30150000,2014-10-27,4,0,0,0,1,7,1000071001
42292,0,2014-10-27,2,0,42,0,42,7,1000071002
55550,0,2014-10-27,2,0,42,0,42,7,1000071002
42293,44250000,2014-03-13,4,1930,0,11,11,8,1000080051
55551,44250000,2014-03-13,4,1930,0,11,11,8,1000080051
42294,10,2014-07-15,4,1987,0,0,0,9,1000090014
55552,10,2014-07-15,4,1987,0,0,0,9,1000090014
42295,128575277,2014-01-09,4,1930,0,64,64,10,1000100016
55553,128575277,2014-01-09,4,1930,0,64,64,10,1000100016
111898,0,2015-04-29,4,1908,3,1,4,11,1000110015
125285,0,2015-04-29,4,1908,3,1,4,11,1000110015
111899,14250000,2015-11-17,4,1930,0,5,5,11,1000110017
125286,14250000,2015-11-17,4,1930,0,5,5,11,1000110017
42296,173000000,2014-09-12,4,1935,0,22,22,11,1000110021
55554,173000000,2014-09-12,4,1935,0,22,22,11,1000110021
111900,1150000,2015-07-28,2,1930,1,0,1,15,1000151108
125287,1150000,2015-07-28,2,1930,1,0,1,15,1000151108
111901,575000,2015-06-23,2,1930,1,0,1,15,1000151136
125288,575000,2015-06-23,2,1930,1,0,1,15,1000151136
42297,670000,2014-07-23,2,1930,1,0,1,15,1000151152
55555,670000,2014-07-23,2,1930,1,0,1,15,1000151152
42298,569000,2014-05-22,2,1930,1,0,1,15,1000151156
55556,569000,2014-05-22,2,1930,1,0,1,15,1000151156
111902,565000,2015-03-12,2,1930,1,0,1,15,1000151160
125289,565000,2015-03-12,2,1930,1,0,1,15,1000151160
111903,675000,2015-06-12,2,1930,1,0,1,15,1000151170
125290,675000,2015-06-12,2,1930,1,0,1,15,1000151170
...,...,...,...,...,...,...,...,...,...
21138,179000,2014-04-15,1,1945,1,0,1,8946,3089460830
42283,179000,2014-04-15,1,1945,1,0,1,8946,3089460830
90344,350000,2015-07-02,1,1945,1,0,1,8946,3089460830
111890,350000,2015-07-02,1,1945,1,0,1,8946,3089460830
90345,300000,2015-11-13,1,1945,1,0,1,8946,3089460836
111891,300000,2015-11-13,1,1945,1,0,1,8946,3089460836
21139,300000,2014-12-05,1,1945,1,0,1,8946,3089460864
42284,300000,2014-12-05,1,1945,1,0,1,8946,3089460864
90346,0,2015-06-25,1,1945,1,0,1,8946,3089460864
111892,0,2015-06-25,1,1945,1,0,1,8946,3089460864
21140,0,2014-12-05,1,1925,0,0,0,8946,3089460866
42285,0,2014-12-05,1,1925,0,0,0,8946,3089460866
90347,0,2015-06-25,1,1925,0,0,0,8946,3089460866
111893,0,2015-06-25,1,1925,0,0,0,8946,3089460866
90348,0,2015-03-18,1,1945,1,0,1,8946,3089460872
111894,0,2015-03-18,1,1945,1,0,1,8946,3089460872
21141,320000,2014-03-27,1,1925,1,0,1,8946,3089460982
42286,320000,2014-03-27,1,1925,1,0,1,8946,3089460982
90349,0,2015-07-10,1,1925,1,0,1,8946,3089460996
111895,0,2015-07-10,1,1925,1,0,1,8946,3089460996
21142,0,2014-06-26,1,1925,1,0,1,8955,3089550168
42287,0,2014-06-26,1,1925,1,0,1,8955,3089550168
21143,505000,2014-08-27,1,1955,2,0,2,8955,3089550178
42288,505000,2014-08-27,1,1955,2,0,2,8955,3089550178
90350,690000,2015-12-21,1,1955,2,0,2,8955,3089550179
111896,690000,2015-12-21,1,1955,2,0,2,8955,3089550179
90351,395000,2015-09-15,1,1925,1,0,1,8955,3089550196
111897,395000,2015-09-15,1,1925,1,0,1,8955,3089550196
21144,500000,2014-06-06,1,1925,1,0,1,8955,3089550228
42289,500000,2014-06-06,1,1925,1,0,1,8955,3089550228